const data = [
  {
    "dichotomies": [
      {"type":"I", 
        "description": "انطوائي",
        "meaning": "يركز على الداخل، ويكتسب الطاقة من العزلة، وهو عاكس ومتحفظ في البيئات الاجتماعية"
      },
      {"type":"E", 
        "description": "منفتح",
        "meaning": "يركز على الخارج، ويكتسب الطاقة من التفاعلات الاجتماعية، منفتح، معبر"
      },
      {"type":"S", 
        "description": "حسي",
        "meaning": "يركز على المعلومات الملموسة والتفاصيل والتطبيق العملي ويعتمد على الحواس الخمس"
      },
      {"type":"N", 
        "description": "حدسي",
        "meaning": "يركز على الأفكار المجردة والإمكانيات والأنماط، ويعتمد على الحدس والخيال"
      },
      {"type":"T", 
        "description": "تفكيري",
        "meaning": "يتخذ القرارات بناءً على المنطق والتحليل الموضوعي والمبادئ الموجهة نحو الحقيقة"
      },
      {"type":"F", 
        "description": "إحساس",
        "meaning": "يتخذ القرارات على أساس القيم والعواطف والتعاطف والموجهة نحو الانسجام"
      },
      {"type":"J", 
        "description": "الحكم",
        "meaning": "يفضل التنظيم والتخطيط وحاسم والموجه نحو الإغلاق"
      },
      {"type":"P", 
        "description": "الإدراك",
        "meaning": "يفضل المرونة والعفوية والقدرة على التكيف والانفتاح والتوجه نحو الاستكشاف"
      }
    ]
  },
  {
    "types": [
      {
        "type": "ISTJ",
        "title":"لوجستي",
        "description": "ISTJ (المنظم) هو نوع شخصية يتميز بالصفات الداخلي، الملاحظ، التفكير، والقضاء. يميل هؤلاء الأشخاص إلى أن يكونوا محجوزين ولكن إرادتهم قوية، مع نظرة رشيدة على الحياة. يُكونون أفعالهم بحرص ويُنفذونها بغرض منهجي.",
        "traits": [
          "عملي ومنحصر في التفاصيل",
          "مركزون على التقاليد والنظام",
          "صناع قرارات منطقية",
          "محجوزين وخاصين"
        ],
        "strengths": [
          "موثوقون ومسؤولون",
          "منظمون ومترتبون",
          "موالون وملتزمون",
          "دقيقون ومعتمدون"
        ],
        "weaknesses": [
          "قد يكونون صارمين للغاية",
          "قد يواجهون صعوبة في التغيير",
          "قد تعيقهم طبيعتهم المحجوزة العلاقات الاجتماعية",
          "ميل للتركيز على التجارب السابقة"
        ]
      },
      {
        "type": "ESTJ",
        "title":"التنفيذي",
        "description": "ESTJ (التنفيذي) هو نوع شخصية يتميز بالصفات الخارجي، الملاحظ، التفكير، والقضاء. يمتلكون إصرارًا كبيرًا، ويتبعون بشغف تقديرهم العقلاني العملي. غالبًا ما يعملون كقوة تثبيتية بين الآخرين، قادرين على تقديم توجيه صلب في وسط الصعوبات.",
        "traits": [
          "عملي ومنحصر في النتائج",
          "لديهم شعور قوي بالمسؤولية",
          "تواصل مباشر وجريء",
          "منظمون ومترتبون"
        ],
        "strengths": [
          "قدرات قيادية ممتازة",
          "كفاءة وإنتاجية",
          "مركزون على الأهداف والنتائج",
          "موثوقون ومعتمدون"
        ],
        "weaknesses": [
          "قد يكونون متحكمين للغاية",
          "قد يواجهون صعوبة في تفويض المهام",
          "لا يتسامحون مع عدم الكفاءة",
          "انتقادات صارمة للقواعد"
        ]
      },
      {
        "type": "ISTP",
        "title":"الفنان",
        "description": "ISTP (الفنان) هو نوع شخصية يتميز بالصفات الداخلي، الملاحظ، التفكير، والاستكشاف. يميلون إلى أن يكون لديهم عقلية فردية، يسعون لتحقيق الأهداف دون الحاجة إلى اتصال خارجي كبير. يشاركون في الحياة بفضول ومهارة شخصية، يختلفون في نهجهم حسب الحاجة.",
        "traits": [
          "قابل للتكيف وموارد",
          "حل المشاكل عمليًا",
          "مركزون على الواقعات الفورية",
          "مستقلون ويعتمدون على أنفسهم"
        ],
        "strengths": [
          "نهج عملي للتحديات",
          "تفكير تحليلي ومنطقي",
          "هدوء تحت الضغط",
          "قرارات سريعة الاتخاذ"
        ],
        "weaknesses": [
          "سلوك يخاطر",
          "ميل للحجز أو الانعزال",
          "كراهية الروتين أو المهام المتكررة",
          "صعوبة التعبير عن المشاعر"
        ]
      },
      {
        "type": "ESTP",
        "title":"رائد الأعمال",
        "description": "ESTP (رائد الأعمال) هو نوع شخصية يتميز بالصفات الخارجي، الملاحظ، التفكير، والاستكشاف. يميلون إلى أن يكونوا نشطين وموجهين للعمل، يتنقلون بمهارة في كل ما يواجههم. يحبون اكتشاف فرص الحياة، سواء بالتواصل مع الآخرين أو في مجالات أكثر شخصية.",
        "traits": [
          "نشط وموجه نحو العمل",
          "يزدهر في بيئات سريعة الخطى",
          "مهارات عملية لحل المشكلات",
          "قابلون للتكيف ومرنون"
        ],
        "strengths": [
          "ممتاز في التفكير على الفور",
          "ساحر ومقنع",
          "مهارات في الشبكات والتواصل مع الآخرين",
          "تفاؤلي وواثق"
        ],
        "weaknesses": [
          "سلوك الميل للاندفاع والمخاطرة",
          "انتباه قصير للمهام الروتينية",
          "قد يكونون عديمي الحس بمشاعر الآخرين",
          "صعوبة في التخطيط على المدى الطويل"
        ]
      },
      {
        "type": "ISFJ",
        "title":"المدافع",
        "description": "SFJ (المدافع) هو نوع شخصية يتميز بالصفات الداخلي، الملاحظ، المشاعر، والقضاء. يميل هؤلاء الأشخاص إلى أن يكونوا دافئين وبسيطين بطريقتهم الثابتة. إنهم فعالون ومسؤولون، يولون اهتمامًا دقيقًا للتفاصيل العملية في حياتهم اليومية.",
        "traits": [
          "رحوب ومهتم بالتعاون",
          "مركزون على التناغم والتعاون",
          "منحصرون في التفاصيل ودقيقون",
          "محجوزون وخاصين"
        ],
        "strengths": [
          "مخلصون وموالون للآخرين",
          "مستمعون ومستشارون ممتازون",
          "داعمون وراعون",
          "موثوقون ومسؤولون"
        ],
        "weaknesses": [
          "ميل لتجنب الصراع",
          "قد يعطلون احتياجات الآخرين على حسابهم الخاص",
          "صعوبة في التأكيد على أنفسهم",
          "حساسية للانتقادات"
        ]
      },
      {
        "type": "ESFJ",
        "title":"القائد",
        "description": "ESFJ (القائد) هو نوع شخصية يتميز بالصفات الخارجي، الملاحظ، المشاعر، والقضاء. إنهم مراقبون وموجهون للناس، ويستمتعون بالمشاركة في مجتمعهم الاجتماعي. تُوجه إنجازاتهم قيم قاطعة، ويُقدمون بكرم توجيههم للآخرين.",
        "traits": [
          "دافئ واجتماعي",
          "مركزون على الحفاظ على العلاقات",
          "داعمون ورعون",
          "منظمون ومترتبون"
        ],
        "strengths": [
          "ممتازون في التواصل مع الآخرين",
          "عاطفيون ومتعاطفون",
          "جيدين في إدارة الناس والمهام",
          "موثوقون ومسؤولون"
        ],
        "weaknesses": [
          "قد يعطلون احتياجات الآخرين على حسابهم الخاص",
          "صعوبة في التعامل مع الانتقادات أو الصراعات",
          "ميل للتناسل الزائد",
          "يمكن اعتبارهم متحكمين للغاية"
        ]
      },
      {
        "type": "ISFP",
        "title":"المغامر",
        "description": "ISFP (المغامر) هو نوع شخصية يتميز بالصفات الداخلي، الملاحظ، المشاعر، والاستكشاف. يميلون إلى أن يكونوا لديهم عقول مفتوحة، يقتربون من الحياة والتجارب الجديدة والناس بدفء أرضي. قدرتهم على البقاء في اللحظة يساعدهم على اكتشاف إمكانيات مثيرة.",
        "traits": [
          "حساس وعاطفي",
          "فني وإبداعي",
          "مرنون وقابلون للتكيف",
          "مخلصون وداعمون"
        ],
        "strengths": [
          "تقدير للجمال والجمال",
          "نظام قيم قوي",
          "عاطفيون ومتعاطفون",
          "القدرة على خلق بيئات متناغمة"
        ],
        "weaknesses": [
          "قد يتجنبون الصراع بأي ثمن",
          "ميل للحساسية الزائدة",
          "صعوبة في التخطيط على المدى الطويل",
          "صعوبات في التعامل مع الانتقادات أو الردود السلبية"
        ]
      },
      {
        "type": "ESFP",
        "title":"المرح",
        "description": "ESFP (المرح) هو نوع شخصية يتميز بالصفات الخارجي، الملاحظ، المشاعر، والاستكشاف. هؤلاء الأشخاص يحبون التجارب الحية، ويشاركون في الحياة بشغف ويستمتعون باكتشاف المجهول. يمكن أن يكونوا اجتماعيين للغاية، وغالبًا ما يشجعون الآخرين على المشاركة في الأنشطة المشتركة.",
        "traits": [
          "نشط ومتحمس",
          "يحب أن يكون في مركز الاهتمام",
          "عفوي وقابل للتكيف",
          "متوجهون نحو الناس واجتماعيون"
        ],
        "strengths": [
          "ساحر وجذاب",
          "ممتاز في إسعاد الآخرين",
          "متفائلون ويحبون المرح",
          "جيدين في التواصل مع الناس"
        ],
        "weaknesses": [
          "ميل لتجنب الصراع",
          "يمكن أن يكونوا عرضيين ومتهورين",
          "انتباه قصير للمهام الروتينية",
          "صعوبة في التخطيط على المدى الطويل"
        ]
      },
      {
        "type": "INFJ",
        "title":"الداعم",
        "description": "INFJ (الداعم) هو نوع شخصية يتميز بالصفات الداخلي، الملاحظ، الشعور، والتقييم. إنهم يتصفون بالتفكير العميق والحنون، ويميلون إلى تحقيق التوازن بين القلب والعقل. هؤلاء الأشخاص يحبون خلق تأثير إيجابي على العالم من حولهم.",
        "traits": [
          "ودي وحساس",
          "مركز على الخيال والرومانسية",
          "صداقات قوية وعميقة",
          "منظمون ومترتبون"
        ],
        "strengths": [
          "مفكرين ومبدعين",
          "عميقو التعبير والتأمل",
          "رحوب ومستمعون",
          "مستمعون ومدركون تمامًا"
        ],
        "weaknesses": [
          "يمكن أن يكونوا عدائيين في الظروف السلبية",
          "قد يفقدون الاتصال بالواقع",
          "يتطلبون الكثير من الوقت للتأقلم مع التغييرات الكبيرة",
          "الميل للتحفظ أحيانًا"
        ]
      },
      {
        "type": "ENFJ",
        "title":"المنظم",
        "description": "ENFJ (المنظم) هو نوع شخصية يتميز بالصفات الخارجي، الملاحظ، الشعور، والتقييم. هؤلاء الأشخاص الرائعون يستمتعون بالعلاقات الاجتماعية ويعملون بجد لتحقيق تقدير وتقدير. يشعرون بالرغبة الشديدة في مساعدة الآخرين وتحسين العالم من حولهم.",
        "traits": [
          "حار وتواصلي",
          "مركز على العلاقات الحميمية",
          "يدعمون الآخرين ويحبون مساعدتهم",
          "منظمون ومترتبون"
        ],
        "strengths": [
          "متحفزين وموجهون للأهداف",
          "مهارات في التواصل الفعّال",
          "لديهم قدرة على الإلهام والتأثير",
          "مفكرون وتحليليون"
        ],
        "weaknesses": [
          "قد يضحون بحقوقهم من أجل الآخرين",
          "الميل للاكتئاب إذا شعروا بعدم الفعالية",
          "التوتر عند مواجهة النزاعات",
          "يمكن أن يتجاهلوا احتياجات أنفسهم"
        ]
      },
      {
        "type": "INFP",
        "title":"الفلسفي",
        "description": "INFP (الفلسفي) هو نوع شخصية يتميز بالصفات الداخلي، الملاحظ، الشعور، والتقييم. إنهم يتمتعون بمشاعر قوية ومعقولة، يحبون استكشاف الأفكار والقيم. يميلون إلى التعبير عن مشاعرهم بحرية ويسعون لفهم العالم من خلال قيمهم ومبادئهم الشخصية.",
        "traits": [
          "حساس وإنساني",
          "منحصرون في الخيال والإبداع",
          "يبحثون عن المعنى والتأمل",
          "متحفزون بالقيم والمبادئ"
        ],
        "strengths": [
          "إلهاميون وإبداعيون",
          "مركزون على القيم والعمق",
          "مساعدون وتفهمون",
          "قادرون على تحقيق الرؤى والأهداف"
        ],
        "weaknesses": [
          "الميل للتعبير عن الأحاسيس بشكل مفرط",
          "الحساسية الزائدة للانتقادات",
          "قد يضيعون في الأفكار الكبيرة ويغيبون عن الواقع",
          "صعوبة في التعامل مع القرارات العملية"
        ]
      },
      {
        "type": "ENFP",
        "title":"المتحفز",
        "description": "ENFP (المتحفز) هو نوع شخصية يتميز بالصفات الخارجي، الملاحظ، الشعور، والتقييم. هؤلاء الأشخاص الذين يعتبرون الحياة مليئة بالمغامرات والفرص، يمكن الاعتماد عليهم لإضفاء الحيوية والأمل على الآخرين. يحبون الاكتشاف والتعلم من الآخرين ويسعون لإحداث تأثير إيجابي في العالم.",
        "traits": [
          "مرح ومندفع",
          "منظمون ومترتبون",
          "يدعمون الآخرين ويحبون مساعدتهم",
          "منظمون ومترتبون"
        ],
        "strengths": [
          "إلهاميون ومحفزين",
          "مهارات تواصل ممتازة",
          "إبداعيون ومبدعون",
          "قادرون على الإلهام والتأثير"
        ],
        "weaknesses": [
          "الميل للتعبير عن الأحاسيس بشكل مفرط",
          "الحساسية الزائدة للانتقادات",
          "قد يضيعون في الأفكار الكبيرة ويغيبون عن الواقع",
          "صعوبة في التعامل مع القرارات العملية"
        ]
      },
      {
      "type": "INTJ",
      "title": "المهندس المعماري",
      "description": "INTJ (المهندس المعماري) هو نوع شخصية يتميز بالصفات المتكونة من التفكير الداخلي، الإدراك الذكي، التفكير العقلاني، والتقييم الحاسم. هؤلاء الخبراء الدقيقون يحبون تحسين التفاصيل في الحياة، ويطبقون الإبداع والعقلانية في كل ما يقومون به. عالمهم الداخلي غالبًا ما يكون معقدًا وخاصًا.",
      "traits": [
      "استراتيجي ورؤوي",
      "تحليلي ومنطقي",
      "مستقل وحاسم",
      "محجوز وخاص"
      ],
      "strengths": [
      "قدرات ممتازة في حل المشكلات",
      "تفكير رؤوي ومبتكر",
      "مهارات قيادية قوية",
      "مركزون على الأهداف طويلة المدى"
      ],
      "weaknesses": [
      "الميل للكمالية",
      "قد يبدو غير مبال أو بعيد",
      "صعوبة في التعبير العاطفي",
      "قد يكون حادًا في التقدير للآخرين"
      ]
      },
      {
      "type": "ENTJ",
      "title": "القائد",
      "description": "ENTJ (القائد) هو نوع شخصية يتميز بالصفات المتكونة من الخارجية، الإدراك الذكي، التفكير العقلاني، والتقييم الحاسم. هؤلاء الأشخاص الحاسمين يحبون الزخم وتحقيق الإنجازات. يجمعون المعلومات لبناء رؤاهم الإبداعية ونادرًا ما يترددون لفترة طويلة قبل العمل.",
      "traits": [
      "عرضي واستراتيجي",
      "مستوجه نحو الأهداف وحاسم",
      "قادة طبيعيون ومنظمون",
      "واثقون وحاسمون"
      ],
      "strengths": [
      "متفوقون في قيادة وتحفيز الآخرين",
      "تفكير استراتيجي ورؤوي",
      "فعّالون ومنصبون على النتائج",
      "ماهرون في حل المشكلات"
      ],
      "weaknesses": [
      "قد يكونون حادين في الانتقاد للآخرين",
      "غير مريحين في حالة عدم الكفاءة أو الاخفاق",
      "يميلون لتجاهل مشاعر الآخرين",
      "قد يظهرون كما يتم التصوّر عنهم بأنهم عنيفون جدًا"
      ]
      },
      {
      "type": "INTP",
      "title": "المنطقي",
      "description": "INTP (المنطقي) هو نوع شخصية يتميز بالصفات المتكونة من التفكير الداخلي، الإدراك الذكي، التفكير العقلاني، والتقييم الاستكشافي. هؤلاء المفكرين المرنين يستمتعون بالنهج غير التقليدي للعديد من جوانب الحياة. غالبًا ما يبحثون عن مسارات غير معتادة، مزجًا بين الاستعداد للتجربة والإبداع الشخصي.",
      "traits": [
      "تحليلي وفضولي",
      "مبتكر ومخترع",
      "مستقل ومرن",
      "محجوز ومتأمل"
      ],
      "strengths": [
      "فهم عميق للأنظمة المعقدة",
      "قدرات ممتازة في حل المشكلات الإبداعية",
      "عقلانية ومرونة",
      "ممتازون في إثارة الأفكار"
      ],
      "weaknesses": [
      "الميل للتفكير الزائد أو التحليل المفرط",
      "صعوبة في التعبير العاطفي",
      "يمكن أن يظهروا كمنغلقين أو مستبعدين",
      "صعوبة في التعامل مع المهام الروتينية أو المكررة"
      ]
      },
      {
      "type": "ENTP",
      "title": "المناقش",
      "description": "ENTP (المناقش) هو نوع شخصية يتميز بالصفات المتكونة من الخارجية، الإدراك الذكي، التفكير العقلاني، والتقييم الاستكشافي. يميلون إلى الكون جريئين ومبدعين، يفككون الأفكار ويعيدون بناءها بذكاء كبير. يسعون بقوة نحو تحقيق أهدافهم بالرغم من أي مقاومة قد تواجههم.",
      "traits": [
      "مبتكر ورؤوي",
      "نشط ومتحمس",
      "يستمتعون باكتشاف الأفكار الجديدة",
      "متكيفون ومرنون"
      ],
      "strengths": [
      "قدرات ممتازة في حل المشكلات الإبداعية",
      "متفوقون في عمليات التفكير الإبداعي وإنتاج الأفكار",
      "جذابون ومقنعون",
      "قدرة طبيعية على التواصل مع الآخرين"
      ],
      "weaknesses": [
      "يميلون لكونهم مناقشين في المواقف",
      "قد يكونون حادين في الانتقاد للآخرين",
      "صعوبة في التعامل مع المهام الروتينية أو المكررة",
      "ميلاً إلى العناد واتخاذ المخاطر"
      ]
      }
    ]
  }
];
export default data;